{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "batch_input_shape": [null, 50, 50, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 36, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "dtype": "float32", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "filters": 72, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu", "strides": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "activation": "softmax", "bias_regularizer": null}}], "keras_version": "2.1.6"}